``` sql
CREATE TABLE teams (
    team_name VARCHAR(50) NOT NULL
);


INSERT INTO teams (team_name) VALUES 
('CSK'),
('KKR'),
('GT'),
('DC'),
('LSG');

select * from teams;

+-----------+
| team_name |
+-----------+
| CSK       |
| KKR       |
| GT        |
| DC        |
| LSG       |
+-----------+

**Question:**

Write a SQL query to generate all possible unique match combinations between the teams in the format: team1 VS team2

Expected Output:

+------------+
| matches    |
+------------+
| CSK VS DC  |
| CSK VS GT  |
| CSK VS KKR |
| CSK VS LSG |
| DC VS GT   |
| DC VS KKR  |
| DC VS LSG  |
| GT VS KKR  |
| GT VS LSG  |
| KKR VS LSG |
+------------+

**Solution:**
``` sql

SELECT CONCAT(a.team_name,' VS ', b.team_name) as matches
FROM teams a
JOIN teams b
ON a.team_name < b.team_name
ORDER BY matches;